public class Main {
    public static void main(String[] args) {
        int amount = 12550;
        int part = 20;

        int bonus = amount / part;

        System.out.println("Итоговый бонус: " + bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
